var words = [
	
  ["某","","とある"],
["非常麻烦","形","面倒くさい(めんどうくさい)"],
["伟大，了不起","形","偉い(えらい)"],
["谜团","名","謎(なぞ)"],
["推理","动3","推理する(すいりする)"],
["顺便说","副","ちなみに"],
["默不作声","动1","黙る(だまる)"],
["不合格","名","失格(しっかく)"],
["苦","形","苦い(にがい)"],
["怪物","名","怪物(かいぶつ)"],
["完美","名","完璧(かんぺき)"],
["狡猾","形","ずるい"],
["解决","名","解決(かいけつ)"],
["谨慎","形动","慎重だ(しんちょうだ)"],
["反应","名","反応(はんのう)"],
["吵闹","名","騒ぎ(さわぎ)"],
["附近","名","あたり"],
["矛盾","名","矛盾(むじゅん)"],
["解除","名","解除(かいじょ)"],
["多少,多么","词组","どれだけ"]

]

var cats = {};
words.forEach(function(a){
    var c = a[1];
    if(!cats[c])
        cats[c] = [];
    cats[c].push(a);
})

try {
    module.exports = {
  length: words.length,
  words,
  cats
}
}catch(e){
    
}
