var words = [
	
   ["", "", ""],
   ["任务", "名", "任務(にんむ)"],
   ["渴", "", "喉が渇く(のどがかわく)"],
   ["第二天", "名", "翌日(よくじつ)"],
   ["突然，冷不防", "副", "いきなり"],
   ["完全,一模一样", "副", "そっくり"],
   ["艰辛，痛苦", "形", "つらい"],
   ["比较的", "", "比較的(ひかくてき)"],
   ["自立", "动3", "自立する(じりつする)"],
   ["完全，彻底", "副", "完全に(かんぜんに)"],
   ["关键，重要，首要", "名", "肝心(かんじん)"],
   ["本家", "名", "実家(じっか)"],	

]

var cats = {};
words.forEach(function(a){
    var c = a[1];
    if(!cats[c])
        cats[c] = [];
    cats[c].push(a);
})

try {
    module.exports = {
  length: words.length,
  words,
  cats
}
}catch(e){
    
}
