var words = [
	
  ["开玩笑", "", "ふざけん"],
["带领", "动2", "連れる(つれる)"],
["颤抖，哆嗦", "动2", "震える(ふるえる)"],
["形状", "名", "形(かたち)"],
["满分", "名", "満点(まんてん)"],
["如果…就", "接续", "だと"],
["好好地，整整齐齐", "副", "きちんと"],
["疏忽大意", "动3", "油断する(ゆだんする)"],
["相当", "副", "かなり"],
["崩溃", "动3", "崩壊する(ほうかいする)"],
["迟早", "副", "いずれ"],
噂 戦い
["接连不断", "", "次から次へと"],
["看漏，忽略", "动1", "見落とす"],

]

var cats = {};
words.forEach(function(a){
    var c = a[1];
    if(!cats[c])
        cats[c] = [];
    cats[c].push(a);
})

try {
    module.exports = {
  length: words.length,
  words,
  cats
}
}catch(e){
    
}
