var words = [
	
  ["无可替代","","かけがえのない"],
["单相思","名","片思い(かたおもい)"],
["撒娇","动2","甘える(あまえる)"],
["行动","名","行動(こうどう)"],
["气息","名","息(いき)"],
["诅咒","名","呪い(のろい)"],
["头绪","名","心あたり"],
["伤痕","名","傷跡(きずあと)"],
["天真无邪","形动","無邪気(むじゃき)"],
["触摸","动1","触る(さわる)"],
["依靠,依赖","动1","頼る(たよる)"],

]

var cats = {};
words.forEach(function(a){
    var c = a[1];
    if(!cats[c])
        cats[c] = [];
    cats[c].push(a);
})

try {
    module.exports = {
  length: words.length,
  words,
  cats
}
}catch(e){
    
}
